app/controllers/conglomerado_quincenals_controller.rb

SELECT "conglomerado_quincenals".* FROM "conglomerado_quincenals"
---
  def index
    @conglomerado_quincenals = ConglomeradoQuincenal.all

INSERT INTO "conglomerado_quincenals" ("materia", "tutor", "invito", "rparcial", "rfinal", "resumen", "cierre", "reingresar", "recomendacion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @conglomerado_quincenal = ConglomeradoQuincenal.new(conglomerado_quincenal_params)
    @reportes_semanales = ReporteSemanal.all.order('created_at desc').take(15)
    @conglomerado_quincenal[:tutor] = "Tutor generico"
    calif_arr = [90,90,90,90,90,90,90,90,90,90,90,90,90,90,90]
    @conglomerado_quincenal[:calificaciones] = calif_arr.to_json()
    @conglomerado_quincenal[:promedio] = calif_arr.sum.fdiv(calif_arr.size)
    @conglomerado_quincenal[:horas_desemp] =  @conglomerado_quincenal[:promedio]*0.75
    #alumnos acabaron
    #alumnos aprobaron
    #alumnos concluyeron
    @conglomerado_quincenal[:horas_reportes] = 15
    @conglomerado_quincenal[:total_horas] =  @conglomerado_quincenal[:horas_desemp] + @conglomerado_quincenal[:horas_reportes]
    #total_horas_sugerido

    respond_to do |format|
      if @conglomerado_quincenal.save

UPDATE "conglomerado_quincenals" SET "tutor" = ?, "updated_at" = ? WHERE "conglomerado_quincenals"."id" = ?  [["tutor", "Jorges"], ["updated_at", "2017-09-20 17:08:44.382719"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @conglomerado_quincenal.update(conglomerado_quincenal_params)

DELETE FROM "conglomerado_quincenals" WHERE "conglomerado_quincenals"."id" = ?  [["id", 8]]
---
  def destroy
    @conglomerado_quincenal.destroy

SELECT  "conglomerado_quincenals".* FROM "conglomerado_quincenals" WHERE "conglomerado_quincenals"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def set_conglomerado_quincenal
      @conglomerado_quincenal = ConglomeradoQuincenal.find(params[:id])