app/controllers/reporte_quincenals_controller.rb

SELECT "reporte_quincenals".* FROM "reporte_quincenals"
---
  def index
    @reporte_quincenals = ReporteQuincenal.all

INSERT INTO "reporte_quincenals" ("estatus", "localizado", "comentarios", "tutor", "alumno", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["estatus", "0"], ["localizado", "1"], ["comentarios", "1"], ["tutor", "David B"], ["alumno", "3"], ["created_at", "2017-09-22 16:13:16.331607"], ["updated_at", "2017-09-22 16:13:16.331607"]]
---
  def create
    @reporte_quincenal = ReporteQuincenal.new(reporte_quincenal_params)
    @reporte_quincenal[:tutor] = ID
    @reporte_quincenal[:fecha] = Date.today

    respond_to do |format|
      if @reporte_quincenal.save

UPDATE "reporte_quincenals" SET "estatus" = ?, "localizado" = ?, "comentarios" = ?, "alumno" = ?, "updated_at" = ? WHERE "reporte_quincenals"."id" = ?  [["estatus", "1"], ["localizado", "1"], ["comentarios", ""], ["alumno", "1"], ["updated_at", "2017-09-21 17:21:19.111679"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @reporte_quincenal.update(reporte_quincenal_params)

SELECT  "reporte_quincenals".* FROM "reporte_quincenals" WHERE "reporte_quincenals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_reporte_quincenal
      @reporte_quincenal = ReporteQuincenal.find(params[:id])