app/controllers/reportes_controller.rb

SELECT "reportes".* FROM "reportes"
---
  def index
    @reportes = Reporte.all

INSERT INTO "reportes" ("titulo", "descripcion", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titulo", "Hola"], ["descripcion", "Prueba"], ["created_at", "2017-09-11 21:24:50.172955"], ["updated_at", "2017-09-11 21:24:50.172955"]]
---
  def create
    @reporte = Reporte.new(reporte_params)

    respond_to do |format|
      if @reporte.save

UPDATE "reportes" SET "titulo" = ?, "updated_at" = ? WHERE "reportes"."id" = ?  [["titulo", "Rodrigo Martinez"], ["updated_at", "2017-09-15 15:44:45.453545"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @reporte.update(reporte_params)

DELETE FROM "reportes" WHERE "reportes"."id" = ?  [["id", 3]]
---
  def destroy
    @reporte.destroy

SELECT  "reportes".* FROM "reportes" WHERE "reportes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_reporte
      @reporte = Reporte.find(params[:id])