app/controllers/reporte_semanals_controller.rb

  def create
    @reporte_semanal = ReporteSemanal.new(reporte_semanal_params)

    info_curso = Curso.where(grupo: @reporte_semanal[:curso]).first
    @reporte_semanal[:coordinador_tutores] = info_curso.coordinador_tutores
    @reporte_semanal[:periodo] = info_curso.periodo
    @reporte_semanal[:campus] = info_curso.campus

    @reporte_semanal[:calificacion_total] = get_calif_total(@reporte_semanal)

    respond_to do |format|
      if @reporte_semanal.save
---
INSERT INTO "reporte_semanals" ("tutor", "califPlazo", "califRubrica", "retro", "responde", "errores", "comentarios", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_reporte_semanal
      @reporte_semanal = ReporteSemanal.find(params[:id])
---
SELECT  "reporte_semanals".* FROM "reporte_semanals" WHERE "reporte_semanals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]